/***************************

- ค่า PID

***************************/

#define Kp_normal 25.0
#define Ki_normal 0.0
#define Kd_normal 28.0

/***************************

- การเลี้ยว

***************************/

int Slow_L = 70; // power ในการเลี้ยว
int Slow_R = 70;

int time_pre_turn_normal = 20; // หน่วงเวลาให้เลี้ยวก่อนจะเลี้ยวจับเส้น (การเลี้ยวฉาก)
int time_pre_turn_wide = 60; // หน่วงเวลาให้เลี้ยวก่อนจะเลี้ยวจับเส้น (การกลับหลังหัน)
int time_pre_turn_smallsqure = 20; // หน่วงเวลาให้เลี้ยวก่อนจะเลี้ยวจับเส้น (ในพื้นที่สี่เหลี่ยม หน้าจุด Start)

/***************************

- ตอนสุดท้าย

***************************/

int spd_Finish = 60; // power ในการถอยหลังเข้า-วิ่งเข้า จุด Finish ตอนสุดท้าย